[
	{
		"type": "thought-leadership",
		"content": "You're not hybrid if...\n\nOffice days are mandated\nRemote work needs approval\nCulture only happens face-to-face\nMost of your team is in one location\nInformation gets trapped in buildings\nSome meetings are only for the office\nBrainstorming must take place in person\nIn-office workers get preferential treatment\n\n\nHybrid is incredibly hard. I've advised about its challenge…for years. It's even more complex today. We have more variables…at scale…than ever. Causing most companies to miss the mark.\n\n\n\nThe solution? Hybrid must be a subset of Remote First. That doesn't mean an office has no value. (that's a larger conversation) It means with one person remote… …the company MUST operate remotely. To prevent these and other problems.\n\n\n\nWant a better hybrid workplace? You need to be Remote First. I have FOUR strategies you can apply ASAP. Comment below and I'll send them to you."
	},
	{
		"type": "how-to",
		"content": "4 steps to build a $100M funnel before 5pm today. (With examples)\n\n\n\nStep 1: Advertorial Landing Page\n\nQualify your traffic\nGet them reading and interested\nGet buy-in for the next step\n\n\nStep 2: VSL (optional)\n\nMake the prospect watch your ads\nBefore/afters, brand stories, and social proof\nQualify - only people truly interested will hit the main site\n\n\nStep 3: Quiz\n\n3 quick questions on one page\nSegment your remarketing audience\nGet customer intent data\n\n\nStep 4: Offer\n\nLanding page with big bundle discount\nNo links to anywhere else\nSubscribe option unchecked\n\n\nWhat's stopping you from running this funnel?\n\nYou have the landing page builder (use Replo (YC S21)).\nYou have the product.\nMost brands are just missing:\nA great copywriter\nIdeating & concepting the offer\nTesting and iterating the funnel\n\n\nCopywriting and offer testing is the #1 skill in this business. This funnel is extremely simple technically. You could make it and go live today with assets you already have. But almost nobody does. Real marketing is brain work. If you're not thinking - you're not doing it.\n\n\n\nPS. Most agencies can't do this stuff."
	},
	{
		"type": "how-to",
		"content": "You're doing attribution wrong. Here's how to fix it:\n\n\n\n1. Pull your post-purchase \"how did you hear about us\" survey data\n\n2. Make sure you're only looking at new customers\n\n3. Divide the # of orders attributed in the survey by the % of total new customers accounted for. example. → 46% of new customers complete the survey → you have 12 survey answers from TikTok in the period you're interested in. → 12/0.46 = 26 projected new customers from TikTok.\n\n4. Divide your total spend on the channel by the projected new customers you found above. → $4,000 in TT spend → 26 projected customers → $4000/26 = $154 projected CPA\n\n5. To calculate ROAS, use the per-channel AOV. → Multiply the orders for each channel by the per-channel AOV → 26 customers from TikTok, $104 AOV → 26*104 = $2704 revenue. → 4000/2704 = 0.676 ROAS\n\n\n\nNow you are looking at apples-to-apples comparisons of ROAS per channel. No platform biases. No weird modeling. Just where your customers tell you they found you from.\n\n\n\nThen try this: Allocate more budget to the channel with the lowest customer attributed CPA. See what happens to your blended nCPA. ;)"
	},
	{
		"type": "list",
		"content": "LinkedIn is incredible for Ecommerce education. But only if you know where to look. Here are my top 7 recommended creators (and why):\n\n\n\nCreator: Jeremy Horowitz\n   Subjects: Brand Breakdowns, Market Trends, Investments\n\n   Why: Jeremy doesn't just curate content we've all heard before. He spends hours studying a variety of different companies, breaks down their entire business, and makes his recommendations. Putting such bold opinions out there and your reputation on the line constantly requires a certain level of courage. Jeremy constantly helps me think outside the box.\n\n\n\nCreator: Sean Riley\n   Subjects: Marketing, Retail, Founder insights\n\n   Why: Honestly, I don't think there are many better/bigger disruptors I've seen in the Ecommerce/retail space than Sean and his team at Dude Wipes. From hilarious 💩 jokes, to crazy viral marketing stunts, they are revolutionizing the $13Bn toilet paper industry. If Sean can make toilet paper sexy, I don't think anyone has an excuse.\n\n\n\nCreator: Kait Stephens\n   Subjects: Omnichannel Marketing\n\n   Why: The integration between Ecommerce and Retail has become more important than ever - Kait is leading the charge in educating the market. Although, arguably her best content is when she shares her personal stories - which show her human side. She's an inspirational female voice.\n\n\n\nCreator: Will Nitze\n   Subjects: Entrepreneurship, CPG Brand Building\n\n   Why: There are many best practices on LinkedIn but apart from consistently posting, Will ignores most of them. His original philosophy to business, and the fact he also walks the walk with his monumental success at IQ Bar is a true testament to what entrepreneurship is all about. Crazy ideas, original thinking, and being free. Will has them all in abundance.\n\n\n\nCreator: Jake Abrams\n   Subjects: Paid advertising, UGC Content, Strategy\n\n   Why: There are plenty of consultants out there who've got impressive CVs and rely on their fancy slide decks to work with household names. Few are actually in the arena getting their hands dirty. Jake is the exception. He relentlessly tests new strategies and then reports back on what works, and what doesn't. These are the kind of marketers who move the needle: Dynamic problem solvers.\n\n\n\nCreator: Erica Rankin\n   Subjects: Building a Brand in Public\n\n   Why: I came across Erica recently and she's a breath of fresh air. Founder-led branding is so important in today's day and age. Erica is the perfect role model to learn from - taking bold risks and sharing not only the good but also the bad - and having a ton of fun along the way!\n\n\n\nCreator: Ben Cogan\n   Subjects: Acquisitions, Market Trends, Financial Analysis\n\n   Why: Ben doesn't post quite as often but when he does trust me it's worth the wait. His posts are an explosion of knowledge that will blow your mind. He's one of the very best, bar none.\n\n\n\nBookmark these 7 and diversify your industry knowledge today."
	},
	{
		"type": "observation",
		"content": "99.9999% of B2B marketing copy I see doesn't address:\n\nYour audience's problems\nYour audience's pain points\nYour audience's deepest fears\nWay too much guessing. Not enough knowing."
	},
	{
		"type": "how-to",
		"content": "Copy\n\nMind blowing fact: it takes on average 6-8 touches to book a meeting with your prospect. Yet 85% of salespeople give up after the 2nd touch. Here's how you can follow up with your multiple touch points:\n\n\n\nCold call or cold email\nOne of the above\nLinkedIn connection request, clever comment, and like on a post\nSend an email with something of value, use a GIF\nSend a 30-second video\n\n\nThere are more ways! Don't be BORING, use your brain."
	},
	{
		"type": "observation",
		"content": "CMO's are unbelievable. They aren't just unbelievable at marketing. They're unbelievable at: \n\n-Copywriting \n\n-Finance \n\n-Art direction \n\n-Project management \n\n-eCommerce \n\n-Research \n\n-Psychology \n\nYou can't JUST be a marketer."
	},
	{
		"type": "advice",
		"content": "This is your friendly reminder that people need to trust you before making a buying decision. And trust rarely is built at the very first touchpoint. If you share stories on:\n\nHow you helped your clients get their desired results\nCompetence based educational content\nHow they can make some progress to get from A to B (No googleable tips, but actually experience based content)\nThey will keep you in mind to solve bigger problems or execute the strategy for them. Focus on building trust first. Are you posting but not getting opportunities coming TO you because of your content? If the answer is no, it's time to reset and adjust your strategy.\n\nPS. If you don't know where to start, check out my feature section to learn more about how I can help you with that.\n\nPPS. Repost to spread this message ♻️♻️"
	}
]
